<?php
require_once('Product.php');

  //暫定でデータを保持するクラスを作成　後ほどDBに処理を移す

  $date1 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $date2 = new Product('ライオンの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $date3 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、メスになります。','40000', './img/skull-937248_1920.jpg');
  $date4 = new Product('チーターの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。','40000', './img/skull-937248_1920.jpg');
  $date5 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。','40000', './img/skull-937248_1920.jpg');
  $date6 = new Product('ライオンの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000','./img/skull-937248_1920.jpg');
  $date7 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $date8 = new Product('オオカミの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $date9 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $date10 = new Product('トラの骨', 'アフリカで狩られたトラの骨です。推定3歳～4際、オスになります。', '40000', './img/skull-937248_1920.jpg');
  $dates = array($date1, $date2, $date3, $date4, $date5, $date6, $date7, $date8, $date9, $date10);

?>
